{
  "videoId": "lxAQoVK0Ub4",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0.08,
      "duration": 4.88,
      "text": "Opus 4.5 is the only one that got this"
    },
    {
      "start": 2,
      "duration": 4.72,
      "text": "right. I use Opus 4.15 in the business."
    },
    {
      "start": 4.96,
      "duration": 4.08,
      "text": "Well, that for me is enough, right? If a"
    },
    {
      "start": 6.72,
      "duration": 3.999,
      "text": "business owner trusts it, all I'm doing"
    },
    {
      "start": 9.04,
      "duration": 2.96,
      "text": "is doing a bit of fancy testing on the"
    },
    {
      "start": 10.719,
      "duration": 2.88,
      "text": "side, right? And that is the gold"
    },
    {
      "start": 12,
      "duration": 3.679,
      "text": "standard as far as I'm concerned. It got"
    },
    {
      "start": 13.599,
      "duration": 7.121,
      "text": "a gold standard uh grading rubric. But"
    },
    {
      "start": 15.679,
      "duration": 7.44,
      "text": "the TLDDR is that Opus 4.5 was not"
    },
    {
      "start": 20.72,
      "duration": 6.399,
      "text": "perfect, but it was within a couple of"
    },
    {
      "start": 23.119,
      "duration": 6.641,
      "text": "trees and close enough that it was able"
    },
    {
      "start": 27.119,
      "duration": 4.4,
      "text": "to get a real big head start on what"
    },
    {
      "start": 29.76,
      "duration": 3.76,
      "text": "would have been a multi-hour project to"
    },
    {
      "start": 31.519,
      "duration": 3.521,
      "text": "reconcile all of this receipt and"
    },
    {
      "start": 33.52,
      "duration": 3.199,
      "text": "shipping stuff because this is across"
    },
    {
      "start": 35.04,
      "duration": 4,
      "text": "five different species of trees. There's"
    },
    {
      "start": 36.719,
      "duration": 3.761,
      "text": "like 400 some trees involved. It it's a"
    },
    {
      "start": 39.04,
      "duration": 4.4,
      "text": "lot. Uh so it would have been a lot to"
    },
    {
      "start": 40.48,
      "duration": 6,
      "text": "reconcile by hand. Opus 4.5 gets you"
    },
    {
      "start": 43.44,
      "duration": 4.88,
      "text": "along 10, 12, 15 times faster and is off"
    },
    {
      "start": 46.48,
      "duration": 4.399,
      "text": "but not off by all that much and in"
    },
    {
      "start": 48.32,
      "duration": 4.239,
      "text": "places is absolutely correct and also"
    },
    {
      "start": 50.879,
      "duration": 3.68,
      "text": "acknowledges both discrepancy and"
    },
    {
      "start": 52.559,
      "duration": 3.52,
      "text": "uncertainty. In the end, it gave a"
    },
    {
      "start": 54.559,
      "duration": 2.961,
      "text": "useful answer, which is really the gold"
    },
    {
      "start": 56.079,
      "duration": 3.12,
      "text": "standard. And that goes back to this"
    },
    {
      "start": 57.52,
      "duration": 4.08,
      "text": "idea that it has this agentic quality"
    },
    {
      "start": 59.199,
      "duration": 6.801,
      "text": "that stays on task and focuses even in a"
    },
    {
      "start": 61.6,
      "duration": 4.4,
      "text": "messy task window and is able to deliver"
    }
  ],
  "fullText": "Opus 4.5 is the only one that got this right. I use Opus 4.15 in the business. Well, that for me is enough, right? If a business owner trusts it, all I'm doing is doing a bit of fancy testing on the side, right? And that is the gold standard as far as I'm concerned. It got a gold standard uh grading rubric. But the TLDDR is that Opus 4.5 was not perfect, but it was within a couple of trees and close enough that it was able to get a real big head start on what would have been a multi-hour project to reconcile all of this receipt and shipping stuff because this is across five different species of trees. There's like 400 some trees involved. It it's a lot. Uh so it would have been a lot to reconcile by hand. Opus 4.5 gets you along 10, 12, 15 times faster and is off but not off by all that much and in places is absolutely correct and also acknowledges both discrepancy and uncertainty. In the end, it gave a useful answer, which is really the gold standard. And that goes back to this idea that it has this agentic quality that stays on task and focuses even in a messy task window and is able to deliver",
  "fetchedAt": "2026-01-18T18:34:00.896Z"
}