{
  "videoId": "U_9GWSjooF0",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0.08,
      "duration": 4.8,
      "text": "Let me show you how I turned a very,"
    },
    {
      "start": 2.24,
      "duration": 3.76,
      "text": "very short piece of text for me, one"
    },
    {
      "start": 4.88,
      "duration": 3.039,
      "text": "that would be shorter than I would"
    },
    {
      "start": 6,
      "duration": 3.76,
      "text": "normally use into a really interesting"
    },
    {
      "start": 7.919,
      "duration": 4.321,
      "text": "new creative interface. Okay, here we"
    },
    {
      "start": 9.76,
      "duration": 4.72,
      "text": "are. This is an actual JSON schema. All"
    },
    {
      "start": 12.24,
      "duration": 4.32,
      "text": "I've given it is please respond with a"
    },
    {
      "start": 14.48,
      "duration": 4.799,
      "text": "filled out JSON template that is for a"
    },
    {
      "start": 16.56,
      "duration": 5.2,
      "text": "very creative UI about aliens. Only"
    },
    {
      "start": 19.279,
      "duration": 5.361,
      "text": "respond with the JSON. That is like"
    },
    {
      "start": 21.76,
      "duration": 4.48,
      "text": "eight tokens on the UI. I would normally"
    },
    {
      "start": 24.64,
      "duration": 3.36,
      "text": "give so much more, but I'm showing you"
    },
    {
      "start": 26.24,
      "duration": 4.08,
      "text": "how much power you have just by"
    },
    {
      "start": 28,
      "duration": 4.16,
      "text": "appending it. It responds with a full"
    },
    {
      "start": 30.32,
      "duration": 3.68,
      "text": "JSON template. It's filled it all the"
    },
    {
      "start": 32.16,
      "duration": 3.919,
      "text": "way out. It has imagined what an alien"
    },
    {
      "start": 34,
      "duration": 4.96,
      "text": "UI looks like. And then it goes all the"
    },
    {
      "start": 36.079,
      "duration": 4.401,
      "text": "way down and it says we're done. So I I"
    },
    {
      "start": 38.96,
      "duration": 2.96,
      "text": "went through the first time and I said,"
    },
    {
      "start": 40.48,
      "duration": 2.8,
      "text": "\"What do you think about this?\" And"
    },
    {
      "start": 41.92,
      "duration": 3.44,
      "text": "you'll notice, by the way, that I said"
    },
    {
      "start": 43.28,
      "duration": 4,
      "text": "initiate first contact or the JSON did."
    },
    {
      "start": 45.36,
      "duration": 4,
      "text": "It has it right there. This is a very"
    },
    {
      "start": 47.28,
      "duration": 4.32,
      "text": "faithful rendition. And the model"
    },
    {
      "start": 49.36,
      "duration": 4.32,
      "text": "actually graded it as very faithful and"
    },
    {
      "start": 51.6,
      "duration": 4,
      "text": "perfectly on brief. I thought it could"
    },
    {
      "start": 53.68,
      "duration": 3.92,
      "text": "be better. I went over to Google AI"
    },
    {
      "start": 55.6,
      "duration": 3.92,
      "text": "Studio and I pasted this in and I said,"
    },
    {
      "start": 57.6,
      "duration": 4.08,
      "text": "\"Hey, I would like you to faithfully"
    },
    {
      "start": 59.52,
      "duration": 4.16,
      "text": "follow this JSON and produce a buildable"
    },
    {
      "start": 61.68,
      "duration": 4.88,
      "text": "wireframe of this design.\" Look at how I"
    },
    {
      "start": 63.68,
      "duration": 5.28,
      "text": "get a very nice, faithful JSON response,"
    },
    {
      "start": 66.56,
      "duration": 4.8,
      "text": "a long response. It thinks it through"
    },
    {
      "start": 68.96,
      "duration": 5.4,
      "text": "and now it's given me a perfect"
    },
    {
      "start": 71.36,
      "duration": 3,
      "text": "highfidelity."
    }
  ],
  "fullText": "Let me show you how I turned a very, very short piece of text for me, one that would be shorter than I would normally use into a really interesting new creative interface. Okay, here we are. This is an actual JSON schema. All I've given it is please respond with a filled out JSON template that is for a very creative UI about aliens. Only respond with the JSON. That is like eight tokens on the UI. I would normally give so much more, but I'm showing you how much power you have just by appending it. It responds with a full JSON template. It's filled it all the way out. It has imagined what an alien UI looks like. And then it goes all the way down and it says we're done. So I I went through the first time and I said, \"What do you think about this?\" And you'll notice, by the way, that I said initiate first contact or the JSON did. It has it right there. This is a very faithful rendition. And the model actually graded it as very faithful and perfectly on brief. I thought it could be better. I went over to Google AI Studio and I pasted this in and I said, \"Hey, I would like you to faithfully follow this JSON and produce a buildable wireframe of this design.\" Look at how I get a very nice, faithful JSON response, a long response. It thinks it through and now it's given me a perfect highfidelity.",
  "fetchedAt": "2026-01-18T18:33:08.699Z"
}