{
  "videoId": "nOT4OfMkyFc",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 2,
      "duration": 3,
      "text": " 1 cup (100g) rolled oats."
    },
    {
      "start": 8.978,
      "duration": 3.825,
      "text": " Grind into flour."
    },
    {
      "start": 19.667,
      "duration": 3.727,
      "text": " 3 tbsp cocoa powder."
    },
    {
      "start": 26.067,
      "duration": 6.35,
      "text": " I’m glad to welcome you to my channel!"
    },
    {
      "start": 37.702,
      "duration": 3.678,
      "text": " 3/4 cup (180 ml) hot milk."
    },
    {
      "start": 46.731,
      "duration": 7.572,
      "text": " I always read every your comment and would be grateful for any feedback!"
    },
    {
      "start": 61.114,
      "duration": 4.802,
      "text": " Cover with plastic wrap and leave for 15 minutes."
    },
    {
      "start": 67.509,
      "duration": 3.254,
      "text": " 2 eggs."
    },
    {
      "start": 80.511,
      "duration": 3.531,
      "text": " Sweetener to taste."
    },
    {
      "start": 85.309,
      "duration": 9.462,
      "text": " Which sugar substitute do you prefer? Maybe honey, maple syrup, or stevia? Write it in the comments! "
    },
    {
      "start": 99.623,
      "duration": 8.435,
      "text": " I'm also interested to know from which country you're watching my video?"
    },
    {
      "start": 113.042,
      "duration": 3.597,
      "text": " Banana."
    },
    {
      "start": 119.322,
      "duration": 6.79,
      "text": " Thank you for your support – I’m happy if you subscribe to my channel!"
    },
    {
      "start": 131.103,
      "duration": 6.464,
      "text": " Let’s communicate in the comments – I’m really looking forward to it!"
    },
    {
      "start": 151.204,
      "duration": 5.633,
      "text": " Add the beaten eggs and blend until smooth."
    },
    {
      "start": 159.316,
      "duration": 6.301,
      "text": " Please rate this video by liking and HYPE it or leaving a comment!"
    },
    {
      "start": 176.317,
      "duration": 9.299,
      "text": " Which flour do you like best for baking? Maybe oat flour, almond flour, or wholemeal flour? Feel free to share your choice in the comments!"
    },
    {
      "start": 194.311,
      "duration": 5.689,
      "text": " Add the banana mixture and mix until smooth."
    },
    {
      "start": 206.139,
      "duration": 6.643,
      "text": " You’ll find the recipe in the description below the video."
    },
    {
      "start": 230.83,
      "duration": 3.092,
      "text": " Raisins."
    },
    {
      "start": 234.781,
      "duration": 4.004,
      "text": " Soak in boiling water for a few minutes."
    },
    {
      "start": 243.749,
      "duration": 3.597,
      "text": " Prunes."
    },
    {
      "start": 248.123,
      "duration": 4.639,
      "text": " Finely chop."
    },
    {
      "start": 254.648,
      "duration": 9.364,
      "text": " Have you already baked anything using my recipe? Then go straight to the comments, I'm very interested in what you got!"
    },
    {
      "start": 292.491,
      "duration": 3.613,
      "text": " 1 tsp baking soda."
    },
    {
      "start": 306.993,
      "duration": 3.629,
      "text": " 1 tbsp coconut oil."
    },
    {
      "start": 312.247,
      "duration": 5.649,
      "text": " Spread the oil evenly over the pan. If Your pan is burning, use baking paper."
    },
    {
      "start": 320.45,
      "duration": 3.531,
      "text": " Apple."
    },
    {
      "start": 325.688,
      "duration": 9.625,
      "text": " I’m super curious – which flour and which sweetener do you like best? I definitely want to take your preferences into account."
    },
    {
      "start": 337.922,
      "duration": 5.584,
      "text": " Cut into thin slices."
    },
    {
      "start": 367.836,
      "duration": 5.519,
      "text": " Arrange the apple slices evenly."
    },
    {
      "start": 382.733,
      "duration": 3.466,
      "text": " Walnuts."
    },
    {
      "start": 387.759,
      "duration": 4.574,
      "text": " Finely chop."
    },
    {
      "start": 433.241,
      "duration": 9.445,
      "text": " If you try this cake, be sure to let me know in the comments if you like it! I'm really interested, and I'm sure it will be helpful to others who want to make it."
    },
    {
      "start": 446.638,
      "duration": 5.666,
      "text": " Put it on low heat and cover for 20 minutes."
    },
    {
      "start": 454.075,
      "duration": 3.662,
      "text": " 1/3 cup (80ml) milk."
    },
    {
      "start": 460.714,
      "duration": 3.515,
      "text": " 2 tbsp cocoa powder."
    },
    {
      "start": 465.544,
      "duration": 3.369,
      "text": " 1/2 tbsp coconut oil."
    },
    {
      "start": 494.754,
      "duration": 7.914,
      "text": " Do you like sweet but healthy pastries?\nThen click \"like\" and then \"HYPE\" and bake with me!"
    },
    {
      "start": 514.375,
      "duration": 7.327,
      "text": " Your support really motivates me - just subscribe right now!"
    },
    {
      "start": 525.936,
      "duration": 3.564,
      "text": " Walnuts."
    },
    {
      "start": 537.706,
      "duration": 4.265,
      "text": " Herbal tea + rosebuds + gomphrena flowers."
    },
    {
      "start": 543.905,
      "duration": 6.676,
      "text": " Do you like this format of video recipes?"
    },
    {
      "start": 559.668,
      "duration": 2.261,
      "text": " Lemon + honey."
    },
    {
      "start": 578.451,
      "duration": 7.458,
      "text": "If you enjoyed the recipe, share it with your friends!"
    },
    {
      "start": 600.275,
      "duration": 6.643,
      "text": "So tasty – who will bake this treat? Let me know in the comments!"
    }
  ],
  "fullText": " 1 cup (100g) rolled oats.  Grind into flour.  3 tbsp cocoa powder.  I’m glad to welcome you to my channel!  3/4 cup (180 ml) hot milk.  I always read every your comment and would be grateful for any feedback!  Cover with plastic wrap and leave for 15 minutes.  2 eggs.  Sweetener to taste.  Which sugar substitute do you prefer? Maybe honey, maple syrup, or stevia? Write it in the comments!   I'm also interested to know from which country you're watching my video?  Banana.  Thank you for your support – I’m happy if you subscribe to my channel!  Let’s communicate in the comments – I’m really looking forward to it!  Add the beaten eggs and blend until smooth.  Please rate this video by liking and HYPE it or leaving a comment!  Which flour do you like best for baking? Maybe oat flour, almond flour, or wholemeal flour? Feel free to share your choice in the comments!  Add the banana mixture and mix until smooth.  You’ll find the recipe in the description below the video.  Raisins.  Soak in boiling water for a few minutes.  Prunes.  Finely chop.  Have you already baked anything using my recipe? Then go straight to the comments, I'm very interested in what you got!  1 tsp baking soda.  1 tbsp coconut oil.  Spread the oil evenly over the pan. If Your pan is burning, use baking paper.  Apple.  I’m super curious – which flour and which sweetener do you like best? I definitely want to take your preferences into account.  Cut into thin slices.  Arrange the apple slices evenly.  Walnuts.  Finely chop.  If you try this cake, be sure to let me know in the comments if you like it! I'm really interested, and I'm sure it will be helpful to others who want to make it.  Put it on low heat and cover for 20 minutes.  1/3 cup (80ml) milk.  2 tbsp cocoa powder.  1/2 tbsp coconut oil.  Do you like sweet but healthy pastries?\nThen click \"like\" and then \"HYPE\" and bake with me!  Your support really motivates me - just subscribe right now!  Walnuts.  Herbal tea + rosebuds + gomphrena flowers.  Do you like this format of video recipes?  Lemon + honey. If you enjoyed the recipe, share it with your friends! So tasty – who will bake this treat? Let me know in the comments!",
  "fetchedAt": "2026-01-18T18:34:06.382Z"
}