{
  "videoId": "be-hvAgT2Ac",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0.09,
      "duration": 2.31,
      "text": "Let's talk about the benefits for Apple\nfirst."
    },
    {
      "start": 2.91,
      "duration": 3.69,
      "text": "Why the reaffirmation of 350?\nWhy is this good for them and Apple"
    },
    {
      "start": 6.6,
      "duration": 2.34,
      "text": "intelligence?\nLook, they've had an invisible eye"
    },
    {
      "start": 8.94,
      "duration": 2.76,
      "text": "strategy.\nI mean, if you go back to the last IBD,"
    },
    {
      "start": 11.7,
      "duration": 3.03,
      "text": "everybody sees you felt like Michael J.\nFox, Back to the future."
    },
    {
      "start": 14.91,
      "duration": 5.04,
      "text": "There was really nothing there about it.\nFinally, this is a huge step forward and"
    },
    {
      "start": 19.95,
      "duration": 5.03,
      "text": "it's not going to happen internally.\nHad to happen from Google Gemini looking"
    },
    {
      "start": 24.99,
      "duration": 3.27,
      "text": "to come down to if they never win DOJ\nsuit."
    },
    {
      "start": 28.62,
      "duration": 4.77,
      "text": "This doesn't happen.\nSo it speaks to just brick by brick."
    },
    {
      "start": 33.66,
      "duration": 2.64,
      "text": "They're finally building it.\nAnd I think this is going to be"
    },
    {
      "start": 36.3,
      "duration": 3.15,
      "text": "instrumental to the valuation for Apple\nthis year."
    },
    {
      "start": 39.48,
      "duration": 3.33,
      "text": "If you look at the statement that was\nput out, it was very much for the time"
    },
    {
      "start": 42.81,
      "duration": 3.15,
      "text": "being, this is going to be embedded in\nApple Foundation models."
    },
    {
      "start": 46.14,
      "duration": 3.87,
      "text": "The idea is that they they pull away.\nThey are able to get a grip on their own"
    },
    {
      "start": 50.01,
      "duration": 3.18,
      "text": "foundational models and indeed, Siri\nbecoming actually useful."
    },
    {
      "start": 53.43,
      "duration": 2.61,
      "text": "Do you think they will distance\nthemselves from Google over time?"
    },
    {
      "start": 56.26,
      "duration": 4.34,
      "text": "Look, I think there's a better chance to\nme NFL playoffs than Apple doing"
    },
    {
      "start": 60.6,
      "duration": 4.44,
      "text": "something internally at this point.\nThe reality is this is also a game, a"
    },
    {
      "start": 65.04,
      "duration": 4.47,
      "text": "high stakes poker negotiation that's\ngoing on to terms of a broader deal with"
    },
    {
      "start": 69.51,
      "duration": 2.34,
      "text": "Google that I think they're all going to\nhave to do."
    },
    {
      "start": 72.06,
      "duration": 4.2,
      "text": "Look, I think this will be exclusive.\nAnd because my view is that there's"
    },
    {
      "start": 76.26,
      "duration": 3.12,
      "text": "going to be some sort of subscription\nservice, freemium."
    },
    {
      "start": 79.68,
      "duration": 4.2,
      "text": "You also need a platform for developers,\nand it comes down to like the"
    },
    {
      "start": 84.18,
      "duration": 3.51,
      "text": "revolution, like Apple is watching from\nthe sidelines, from the stands."
    },
    {
      "start": 87.69,
      "duration": 4.2,
      "text": "They need to get into the game.\nAnd that's how we talk about 70 $500 per"
    },
    {
      "start": 91.89,
      "duration": 5.33,
      "text": "share that this adds to the story as\nthey execute on the consumer revolution."
    },
    {
      "start": 97.23,
      "duration": 6.24,
      "text": "Finally going to Cupertino.\nDan, you you had advocated on more than"
    },
    {
      "start": 103.47,
      "duration": 6.99,
      "text": "one occasion that Apple by perplexity\nwith this confirmation of Gemini being"
    },
    {
      "start": 110.46,
      "duration": 3.36,
      "text": "the underpinning of Siri.\nIs such a transaction still necessary to"
    },
    {
      "start": 113.82,
      "duration": 3.06,
      "text": "your mind?\nYeah, and Ed, it's a great point, but a"
    },
    {
      "start": 116.88,
      "duration": 6.27,
      "text": "lot of that was based on as the DOJ suit\nwas going on with Google, there was a"
    },
    {
      "start": 123.18,
      "duration": 2.87,
      "text": "sort of a period there where Apple\nneeded to do something."
    },
    {
      "start": 126.09,
      "duration": 1.98,
      "text": "Now, obviously, perplexity came and\nwent."
    },
    {
      "start": 128.37,
      "duration": 5.97,
      "text": "They're clearly not going to do that.\nBut once Google won the DOJ suit, that"
    },
    {
      "start": 134.34,
      "duration": 5.43,
      "text": "was sort of like green light lights on.\nAnd now it's sort of good time for big"
    },
    {
      "start": 139.77,
      "duration": 2.52,
      "text": "tech.\nAnd I think that speaks to why Apple did"
    },
    {
      "start": 142.29,
      "duration": 2.49,
      "text": "this deal.\nAnd when you look at Google, Gemini,"
    },
    {
      "start": 144.78,
      "duration": 3.9,
      "text": "what they've done, you go back a year\nago, it's phenomenal."
    },
    {
      "start": 148.68,
      "duration": 5.04,
      "text": "And I think Apple is making that bet.\nIt's going to be a much different 2026"
    },
    {
      "start": 154.05,
      "duration": 2.82,
      "text": "than 2025 relative to Apple when it\ncomes to."
    },
    {
      "start": 157.05,
      "duration": 4.53,
      "text": "I\nagain just made the point that Apple was"
    },
    {
      "start": 161.58,
      "duration": 4.44,
      "text": "very careful in the statement to explain\nwhich parts of series functionality"
    },
    {
      "start": 166.02,
      "duration": 4.26,
      "text": "would be underpinned by by Gemini.\nThe other way of looking at is to say,"
    },
    {
      "start": 170.46,
      "duration": 4.38,
      "text": "have they still got a lot of work to do\nto make Syria sort of all encompassing"
    },
    {
      "start": 175.44,
      "duration": 4.83,
      "text": "assistance?\nI mean, it's a it's an Everest like"
    },
    {
      "start": 180.27,
      "duration": 4.02,
      "text": "uphill battle because the reality is\nthey've lost so many developers."
    },
    {
      "start": 184.29,
      "duration": 3.51,
      "text": "There was so much talent.\nYou've seen the odd changing look at you"
    },
    {
      "start": 187.8,
      "duration": 5.16,
      "text": "know it as well as anyone like the DNA\nof Cupertino, why that is supposed to"
    },
    {
      "start": 192.96,
      "duration": 3.12,
      "text": "come internally.\nAnd I think Coke recognizes the writing"
    },
    {
      "start": 196.08,
      "duration": 3.27,
      "text": "on the wall.\nIt speaks to my point that, like Cook is"
    },
    {
      "start": 199.35,
      "duration": 4.16,
      "text": "not going to leave as CEO and we've this\nsort of in transition."
    },
    {
      "start": 203.52,
      "duration": 4.32,
      "text": "He has to get the strategy sorted out.\nIt's going to be a work in progress."
    },
    {
      "start": 207.84,
      "duration": 3.82,
      "text": "But 2.4 billion iOS devices, 1.5 billion\niPhones."
    },
    {
      "start": 211.68,
      "duration": 4.68,
      "text": "It's my view that the consumer\nrevolution ultimately comes through"
    },
    {
      "start": 216.36,
      "duration": 3.54,
      "text": "Cupertino and this is a first step in\nthat direction."
    },
    {
      "start": 219.9,
      "duration": 3.89,
      "text": "We'll obviously see more about it in the\nspring and of course more debate DC."
    },
    {
      "start": 223.86,
      "duration": 5.01,
      "text": "Some might say it's incredibly savvy to\nbe liked, to not have to make all the"
    },
    {
      "start": 228.87,
      "duration": 4.86,
      "text": "investments in the datacenters to be\nable to say, look, privacy first we're"
    },
    {
      "start": 233.73,
      "duration": 3.48,
      "text": "going to lean much more on AI.\nIs that actually going to be a winning"
    },
    {
      "start": 237.21,
      "duration": 4.65,
      "text": "formula for Apple in the in the future\nand as models and sophistication"
    },
    {
      "start": 241.86,
      "duration": 2.34,
      "text": "develops?\nYeah, but also Apple's in a much"
    },
    {
      "start": 244.2,
      "duration": 3.87,
      "text": "different situation because of the\nunrivalled install base because of where"
    },
    {
      "start": 248.07,
      "duration": 3.51,
      "text": "they play in the consumer.\nThat's why from a CapEx perspective,"
    },
    {
      "start": 251.58,
      "duration": 4.77,
      "text": "they're not Microsoft Google know many\nother big tech players, but I think"
    },
    {
      "start": 256.769,
      "duration": 3.991,
      "text": "they've finally hit the point where met\nthe road they need to do something."
    },
    {
      "start": 260.76,
      "duration": 3.09,
      "text": "They're going to have to incrementally\nspend, but they're basically going to"
    },
    {
      "start": 263.85,
      "duration": 3.75,
      "text": "rely on Google as a partner because you\ncannot have the fourth industrial"
    },
    {
      "start": 267.6,
      "duration": 4.53,
      "text": "Revolution biggest tech transition in\nthe last 40 years come and go and they"
    },
    {
      "start": 272.13,
      "duration": 2.49,
      "text": "don't monetize.\nAnd I think that so that they recognize"
    },
    {
      "start": 274.62,
      "duration": 2.46,
      "text": "front and center and it's key to the\nstock."
    },
    {
      "start": 277.32,
      "duration": 5.38,
      "text": "I mean realistically like a year from\nnow stocks 350 or lower from here."
    },
    {
      "start": 282.99,
      "duration": 4.08,
      "text": "It's all based on a high and they're\nmonetizing it."
    }
  ],
  "fullText": "Let's talk about the benefits for Apple\nfirst. Why the reaffirmation of 350?\nWhy is this good for them and Apple intelligence?\nLook, they've had an invisible eye strategy.\nI mean, if you go back to the last IBD, everybody sees you felt like Michael J.\nFox, Back to the future. There was really nothing there about it.\nFinally, this is a huge step forward and it's not going to happen internally.\nHad to happen from Google Gemini looking to come down to if they never win DOJ\nsuit. This doesn't happen.\nSo it speaks to just brick by brick. They're finally building it.\nAnd I think this is going to be instrumental to the valuation for Apple\nthis year. If you look at the statement that was\nput out, it was very much for the time being, this is going to be embedded in\nApple Foundation models. The idea is that they they pull away.\nThey are able to get a grip on their own foundational models and indeed, Siri\nbecoming actually useful. Do you think they will distance\nthemselves from Google over time? Look, I think there's a better chance to\nme NFL playoffs than Apple doing something internally at this point.\nThe reality is this is also a game, a high stakes poker negotiation that's\ngoing on to terms of a broader deal with Google that I think they're all going to\nhave to do. Look, I think this will be exclusive.\nAnd because my view is that there's going to be some sort of subscription\nservice, freemium. You also need a platform for developers,\nand it comes down to like the revolution, like Apple is watching from\nthe sidelines, from the stands. They need to get into the game.\nAnd that's how we talk about 70 $500 per share that this adds to the story as\nthey execute on the consumer revolution. Finally going to Cupertino.\nDan, you you had advocated on more than one occasion that Apple by perplexity\nwith this confirmation of Gemini being the underpinning of Siri.\nIs such a transaction still necessary to your mind?\nYeah, and Ed, it's a great point, but a lot of that was based on as the DOJ suit\nwas going on with Google, there was a sort of a period there where Apple\nneeded to do something. Now, obviously, perplexity came and\nwent. They're clearly not going to do that.\nBut once Google won the DOJ suit, that was sort of like green light lights on.\nAnd now it's sort of good time for big tech.\nAnd I think that speaks to why Apple did this deal.\nAnd when you look at Google, Gemini, what they've done, you go back a year\nago, it's phenomenal. And I think Apple is making that bet.\nIt's going to be a much different 2026 than 2025 relative to Apple when it\ncomes to. I\nagain just made the point that Apple was very careful in the statement to explain\nwhich parts of series functionality would be underpinned by by Gemini.\nThe other way of looking at is to say, have they still got a lot of work to do\nto make Syria sort of all encompassing assistance?\nI mean, it's a it's an Everest like uphill battle because the reality is\nthey've lost so many developers. There was so much talent.\nYou've seen the odd changing look at you know it as well as anyone like the DNA\nof Cupertino, why that is supposed to come internally.\nAnd I think Coke recognizes the writing on the wall.\nIt speaks to my point that, like Cook is not going to leave as CEO and we've this\nsort of in transition. He has to get the strategy sorted out.\nIt's going to be a work in progress. But 2.4 billion iOS devices, 1.5 billion\niPhones. It's my view that the consumer\nrevolution ultimately comes through Cupertino and this is a first step in\nthat direction. We'll obviously see more about it in the\nspring and of course more debate DC. Some might say it's incredibly savvy to\nbe liked, to not have to make all the investments in the datacenters to be\nable to say, look, privacy first we're going to lean much more on AI.\nIs that actually going to be a winning formula for Apple in the in the future\nand as models and sophistication develops?\nYeah, but also Apple's in a much different situation because of the\nunrivalled install base because of where they play in the consumer.\nThat's why from a CapEx perspective, they're not Microsoft Google know many\nother big tech players, but I think they've finally hit the point where met\nthe road they need to do something. They're going to have to incrementally\nspend, but they're basically going to rely on Google as a partner because you\ncannot have the fourth industrial Revolution biggest tech transition in\nthe last 40 years come and go and they don't monetize.\nAnd I think that so that they recognize front and center and it's key to the\nstock. I mean realistically like a year from\nnow stocks 350 or lower from here. It's all based on a high and they're\nmonetizing it.",
  "fetchedAt": "2026-01-18T18:33:34.502Z"
}