{
  "videoId": "txGHMzgH1SY",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0,
      "duration": 4.16,
      "text": "I need a mobile habit tracker app with a"
    },
    {
      "start": 2.08,
      "duration": 4.239,
      "text": "dark theme and I have three screens in"
    },
    {
      "start": 4.16,
      "duration": 3.679,
      "text": "my mind and a calendar view. I want it"
    },
    {
      "start": 6.319,
      "duration": 3.841,
      "text": "to feel sort of like notion meeting"
    },
    {
      "start": 7.839,
      "duration": 4.961,
      "text": "Dolingo, right? If you have a prompt"
    },
    {
      "start": 10.16,
      "duration": 5.12,
      "text": "like what I'm building here, the LLM"
    },
    {
      "start": 12.8,
      "duration": 4.64,
      "text": "will interpret that. It will apply your"
    },
    {
      "start": 15.28,
      "duration": 4.8,
      "text": "design convention. It will fill out a"
    },
    {
      "start": 17.44,
      "duration": 4.08,
      "text": "JSON schema with the screens, the"
    },
    {
      "start": 20.08,
      "duration": 3.039,
      "text": "components, the tokens, and the layout"
    },
    {
      "start": 21.52,
      "duration": 3.12,
      "text": "primitives, and it will let you review"
    },
    {
      "start": 23.119,
      "duration": 2.961,
      "text": "it. You can then look at it and say,"
    },
    {
      "start": 24.64,
      "duration": 3.44,
      "text": "\"Oh, yeah, okay. I think this looks"
    },
    {
      "start": 26.08,
      "duration": 4.48,
      "text": "good.\" And then you can pass that to"
    },
    {
      "start": 28.08,
      "duration": 5.2,
      "text": "Nano Banana Pro to render. And all of"
    },
    {
      "start": 30.56,
      "duration": 4.8,
      "text": "that detail is there for Nano Banana Pro"
    },
    {
      "start": 33.28,
      "duration": 4.08,
      "text": "to pick up. And if you want changes, you"
    },
    {
      "start": 35.36,
      "duration": 3.44,
      "text": "can just swap out one field at a time."
    },
    {
      "start": 37.36,
      "duration": 3.92,
      "text": "And one of the beautiful things about"
    },
    {
      "start": 38.8,
      "duration": 5.759,
      "text": "this approach is it helps people not"
    },
    {
      "start": 41.28,
      "duration": 5.04,
      "text": "familiar with JSON learn one of what I"
    },
    {
      "start": 44.559,
      "duration": 3.121,
      "text": "believe is the most valuable skills in"
    },
    {
      "start": 46.32,
      "duration": 3.28,
      "text": "the world, which is learning to read"
    },
    {
      "start": 47.68,
      "duration": 3.76,
      "text": "pseudo code. Pseudo code, like J, this"
    },
    {
      "start": 49.6,
      "duration": 3.92,
      "text": "JSON blob is not real code. It just"
    },
    {
      "start": 51.44,
      "duration": 4.16,
      "text": "looks like code. All it is is a fancy"
    },
    {
      "start": 53.52,
      "duration": 4.16,
      "text": "list that an AI can read and understand"
    },
    {
      "start": 55.6,
      "duration": 5.36,
      "text": "and take seriously. If you can learn to"
    },
    {
      "start": 57.68,
      "duration": 5.359,
      "text": "read it, you become someone who can read"
    },
    {
      "start": 60.96,
      "duration": 4.4,
      "text": "the kinds of structured inputs that AI"
    },
    {
      "start": 63.039,
      "duration": 4.961,
      "text": "values. As you'd expect, that helps your"
    },
    {
      "start": 65.36,
      "duration": 2.64,
      "text": "career these"
    }
  ],
  "fullText": "I need a mobile habit tracker app with a dark theme and I have three screens in my mind and a calendar view. I want it to feel sort of like notion meeting Dolingo, right? If you have a prompt like what I'm building here, the LLM will interpret that. It will apply your design convention. It will fill out a JSON schema with the screens, the components, the tokens, and the layout primitives, and it will let you review it. You can then look at it and say, \"Oh, yeah, okay. I think this looks good.\" And then you can pass that to Nano Banana Pro to render. And all of that detail is there for Nano Banana Pro to pick up. And if you want changes, you can just swap out one field at a time. And one of the beautiful things about this approach is it helps people not familiar with JSON learn one of what I believe is the most valuable skills in the world, which is learning to read pseudo code. Pseudo code, like J, this JSON blob is not real code. It just looks like code. All it is is a fancy list that an AI can read and understand and take seriously. If you can learn to read it, you become someone who can read the kinds of structured inputs that AI values. As you'd expect, that helps your career these",
  "fetchedAt": "2026-01-18T18:34:32.409Z"
}