{
  "videoId": "3dWPbNilBhI",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0,
      "duration": 3.834,
      "text": "Apple announced that it would be working with Google and "
    },
    {
      "start": 3.834,
      "duration": 2.621,
      "text": "Google models for its next generation of Siri. "
    },
    {
      "start": 6.455,
      "duration": 3.244,
      "text": "I definitely wasn't shocked. If you're a user of Siri,"
    },
    {
      "start": 9.699,
      "duration": 4.301,
      "text": "it's abundantly clear that Apple has solved zero problems in the LLM space."
    },
    {
      "start": 14,
      "duration": 1.17,
      "text": "Yeah, it's pretty bad."
    },
    {
      "start": 15.17,
      "duration": 3.314,
      "text": "Yeah, it's really, really bad. Like I mean, look."
    },
    {
      "start": 18.484,
      "duration": 3.013,
      "text": "Siri was awesome when it came out, but now"
    },
    {
      "start": 21.497,
      "duration": 3.828,
      "text": "it's like severely behind the times. And like there are"
    },
    {
      "start": 25.325,
      "duration": 4.536,
      "text": "often times when I want to subvert Siri and just substitute like "
    },
    {
      "start": 29.861,
      "duration": 2.509,
      "text": "Claude voice mode or something like that instead."
    },
    {
      "start": 32.37,
      "duration": 4.364,
      "text": "Google's Gemini has released a an open version of their model, "
    },
    {
      "start": 36.734,
      "duration": 4.15,
      "text": "right? They've released Gemma. Gemini is based on GEMA. "
    },
    {
      "start": 40.884,
      "duration": 2.686,
      "text": "Um, I would guess that what they're actually doing is"
    },
    {
      "start": 43.57,
      "duration": 7.14,
      "text": "planning to fine tune, uh, either a previously fine tuned version of "
    },
    {
      "start": 50.71,
      "duration": 2.404,
      "text": "GEMA. Or just a larger version of GEMA"
    },
    {
      "start": 53.114,
      "duration": 3.103,
      "text": "basically in order to do their particular things. "
    },
    {
      "start": 56.217,
      "duration": 3.283,
      "text": "What I'm kind of disappointed to see, though, is that "
    },
    {
      "start": 59.5,
      "duration": 3.02,
      "text": "I think that Apple was starting to make strides in sort"
    },
    {
      "start": 62.52,
      "duration": 4.211,
      "text": "of edge intelligence as a way, as a nod towards privacy "
    },
    {
      "start": 66.731,
      "duration": 4.322,
      "text": "and security, as a nod towards not sending every single aspect"
    },
    {
      "start": 71.053,
      "duration": 2.684,
      "text": "of all of your daily conversations to, uh, "
    },
    {
      "start": 73.737,
      "duration": 2.083,
      "text": "some kind of server that's distant."
    }
  ],
  "fullText": "Apple announced that it would be working with Google and  Google models for its next generation of Siri.  I definitely wasn't shocked. If you're a user of Siri, it's abundantly clear that Apple has solved zero problems in the LLM space. Yeah, it's pretty bad. Yeah, it's really, really bad. Like I mean, look. Siri was awesome when it came out, but now it's like severely behind the times. And like there are often times when I want to subvert Siri and just substitute like  Claude voice mode or something like that instead. Google's Gemini has released a an open version of their model,  right? They've released Gemma. Gemini is based on GEMA.  Um, I would guess that what they're actually doing is planning to fine tune, uh, either a previously fine tuned version of  GEMA. Or just a larger version of GEMA basically in order to do their particular things.  What I'm kind of disappointed to see, though, is that  I think that Apple was starting to make strides in sort of edge intelligence as a way, as a nod towards privacy  and security, as a nod towards not sending every single aspect of all of your daily conversations to, uh,  some kind of server that's distant.",
  "fetchedAt": "2026-01-20T17:11:15.846Z"
}