{
  "videoId": "dNmtFUdIoEw",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0.24,
      "duration": 6.4,
      "text": "Yeah. So, uh we are now learning that"
    },
    {
      "start": 2.48,
      "duration": 6.159,
      "text": "the death toll has risen to 203 in uh in"
    },
    {
      "start": 6.64,
      "duration": 3.52,
      "text": "Iran. And one of the most remarkable"
    },
    {
      "start": 8.639,
      "duration": 3.601,
      "text": "things about this is watching these"
    },
    {
      "start": 10.16,
      "duration": 4.639,
      "text": "images that are uh we're seeing out of"
    },
    {
      "start": 12.24,
      "duration": 4.4,
      "text": "Iran. Um the government of course has"
    },
    {
      "start": 14.799,
      "duration": 4.32,
      "text": "cut off the internet to the entire"
    },
    {
      "start": 16.64,
      "duration": 5.84,
      "text": "country. Uh they've even uh cut off"
    },
    {
      "start": 19.119,
      "duration": 4.961,
      "text": "landlines like old timey phone lines uh"
    },
    {
      "start": 22.48,
      "duration": 3.84,
      "text": "because they're trying to keep these"
    },
    {
      "start": 24.08,
      "duration": 4.8,
      "text": "images from getting out. uh they've been"
    },
    {
      "start": 26.32,
      "duration": 5.84,
      "text": "cutting electricity to cities and uh"
    },
    {
      "start": 28.88,
      "duration": 5.12,
      "text": "instepped Elon Musk with Starlink. The"
    },
    {
      "start": 32.16,
      "duration": 5.12,
      "text": "reason that we're seeing these images"
    },
    {
      "start": 34,
      "duration": 7.04,
      "text": "right now is because uh Starlink using"
    },
    {
      "start": 37.28,
      "duration": 6.24,
      "text": "satellites over Iran is able to and it's"
    },
    {
      "start": 41.04,
      "duration": 4.48,
      "text": "not a perfect system. It's not uh not"
    },
    {
      "start": 43.52,
      "duration": 4.719,
      "text": "everybody has the access that they that"
    },
    {
      "start": 45.52,
      "duration": 5.12,
      "text": "they want or that they need, but enough"
    },
    {
      "start": 48.239,
      "duration": 4.081,
      "text": "of these images and and video is getting"
    },
    {
      "start": 50.64,
      "duration": 2.96,
      "text": "out, which is the only reason we're"
    },
    {
      "start": 52.32,
      "duration": 3.44,
      "text": "seeing this. And one of the things I"
    },
    {
      "start": 53.6,
      "duration": 5.439,
      "text": "think is so interesting about this is"
    },
    {
      "start": 55.76,
      "duration": 5.92,
      "text": "that and and a real question is the the"
    },
    {
      "start": 59.039,
      "duration": 5.12,
      "text": "amount the number of uh outlets"
    },
    {
      "start": 61.68,
      "duration": 5.52,
      "text": "mainstream media outlets who are"
    },
    {
      "start": 64.159,
      "duration": 6.081,
      "text": "ignoring this story for some reason. For"
    },
    {
      "start": 67.2,
      "duration": 5.36,
      "text": "some reason they don't uh realize that"
    },
    {
      "start": 70.24,
      "duration": 5.36,
      "text": "this is the biggest story probably in"
    },
    {
      "start": 72.56,
      "duration": 3.44,
      "text": "the Middle East in uh in in nearly 50"
    },
    {
      "start": 75.6,
      "duration": 2.08,
      "text": "years."
    },
    {
      "start": 76,
      "duration": 4.159,
      "text": ">> Yeah. I mean, make no mistake, these"
    },
    {
      "start": 77.68,
      "duration": 5.119,
      "text": "images make a difference because public"
    },
    {
      "start": 80.159,
      "duration": 4.64,
      "text": "opinion uh globally makes a difference."
    },
    {
      "start": 82.799,
      "duration": 4.241,
      "text": "I still remember um I don't know, it was"
    },
    {
      "start": 84.799,
      "duration": 4.721,
      "text": "four years ago when the Cubans had an"
    },
    {
      "start": 87.04,
      "duration": 5.119,
      "text": "uprising and it was quite significant."
    },
    {
      "start": 89.52,
      "duration": 4.32,
      "text": "And what they wanted was video images to"
    },
    {
      "start": 92.159,
      "duration": 5.761,
      "text": "go out to the world, not just of the"
    },
    {
      "start": 93.84,
      "duration": 5.84,
      "text": "protests um but also of the repression"
    },
    {
      "start": 97.92,
      "duration": 5.04,
      "text": "um when the government finally got"
    },
    {
      "start": 99.68,
      "duration": 5.439,
      "text": "control and started to um arrest uh and"
    },
    {
      "start": 102.96,
      "duration": 5.04,
      "text": "and and and beat down many of the"
    },
    {
      "start": 105.119,
      "duration": 6.081,
      "text": "protesters and they were begging Joe"
    },
    {
      "start": 108,
      "duration": 5.36,
      "text": "Biden for the ability um you know to"
    },
    {
      "start": 111.2,
      "duration": 4.64,
      "text": "send some help for satellite so they"
    },
    {
      "start": 113.36,
      "duration": 6.24,
      "text": "could get those images out and Joe Biden"
    },
    {
      "start": 115.84,
      "duration": 6.639,
      "text": "said no. But then when the same things"
    },
    {
      "start": 119.6,
      "duration": 4.72,
      "text": "happened uh two years ago in Venezuela,"
    },
    {
      "start": 122.479,
      "duration": 3.441,
      "text": "Elon Musk, they didn't have to beg Joe"
    },
    {
      "start": 124.32,
      "duration": 3.6,
      "text": "Biden for anything. They were able to"
    },
    {
      "start": 125.92,
      "duration": 4.16,
      "text": "get it from Elon Musk just as the"
    },
    {
      "start": 127.92,
      "duration": 4.24,
      "text": "Iranians are doing. So Elon Musk, you"
    },
    {
      "start": 130.08,
      "duration": 5.68,
      "text": "know, just as he freed Twitter, um"
    },
    {
      "start": 132.16,
      "duration": 6.719,
      "text": "really playing a giant role in um in in"
    },
    {
      "start": 135.76,
      "duration": 5.52,
      "text": "in getting allowing people to to to"
    },
    {
      "start": 138.879,
      "duration": 3.921,
      "text": "speak freely and also for all of us to"
    },
    {
      "start": 141.28,
      "duration": 3.28,
      "text": "see what's going on. And you know to"
    },
    {
      "start": 142.8,
      "duration": 3.84,
      "text": "that point Rachel you got me thinking"
    },
    {
      "start": 144.56,
      "duration": 4.24,
      "text": "he's also like we saw President Trump"
    },
    {
      "start": 146.64,
      "duration": 3.76,
      "text": "saying we've got your back to Iran. Elon"
    },
    {
      "start": 148.8,
      "duration": 4.159,
      "text": "Musk is also standing with them. Just"
    },
    {
      "start": 150.4,
      "duration": 5.119,
      "text": "two days ago Elon Musk responded to"
    },
    {
      "start": 152.959,
      "duration": 3.92,
      "text": "Ayatollah Ket has been ratt saber"
    },
    {
      "start": 155.519,
      "duration": 5.36,
      "text": "rattling and saying we won't be"
    },
    {
      "start": 156.879,
      "duration": 7.041,
      "text": "defeated. And Musk tweeted a very famous"
    },
    {
      "start": 160.879,
      "duration": 5.041,
      "text": "Persian uh saying which is essentially"
    },
    {
      "start": 163.92,
      "duration": 4.64,
      "text": "say that the I told said we won't be"
    },
    {
      "start": 165.92,
      "duration": 4.88,
      "text": "defeated and he he tweeted out in Farsy"
    },
    {
      "start": 168.56,
      "duration": 4.08,
      "text": "he tweeted out that uh you know the the"
    },
    {
      "start": 170.8,
      "duration": 3.84,
      "text": "phrase that means wishful thinking or a"
    },
    {
      "start": 172.64,
      "duration": 4.4,
      "text": "vain fantasy that you won't be defeated"
    },
    {
      "start": 174.64,
      "duration": 5.44,
      "text": "and these protesters have been chanting"
    },
    {
      "start": 177.04,
      "duration": 4.8,
      "text": "that phrase in these protest last point"
    },
    {
      "start": 180.08,
      "duration": 5.04,
      "text": "it is so amazing because Lucas talked"
    },
    {
      "start": 181.84,
      "duration": 5.92,
      "text": "about pre979 Iran so many anyone under"
    },
    {
      "start": 185.12,
      "duration": 4.88,
      "text": "40 years old is fighting for freedom"
    },
    {
      "start": 187.76,
      "duration": 3.68,
      "text": "that they have never in their life."
    },
    {
      "start": 190,
      "duration": 3.68,
      "text": ">> That's such a great point. Well, you saw"
    },
    {
      "start": 191.44,
      "duration": 3.68,
      "text": "that uh that tweet out from Lindsey"
    },
    {
      "start": 193.68,
      "duration": 2.88,
      "text": "Graham. A lot of people get nervous when"
    },
    {
      "start": 195.12,
      "duration": 3.28,
      "text": "they see Lindsey Graham promoting"
    },
    {
      "start": 196.56,
      "duration": 3.84,
      "text": "something um some kind of military"
    },
    {
      "start": 198.4,
      "duration": 3.6,
      "text": "foreign action. Um but it's going to be"
    },
    {
      "start": 200.4,
      "duration": 3.759,
      "text": "interesting because we're going to have"
    },
    {
      "start": 202,
      "duration": 4.08,
      "text": "Patrick Bet David. He is a refugee from"
    },
    {
      "start": 204.159,
      "duration": 5.121,
      "text": "Iran. He's a very famous, as you guys"
    },
    {
      "start": 206.08,
      "duration": 4.719,
      "text": "know, podcaster um and businessman in"
    },
    {
      "start": 209.28,
      "duration": 3.92,
      "text": "America here. and we're going to have"
    },
    {
      "start": 210.799,
      "duration": 4.16,
      "text": "him come on to explain, you know, what's"
    },
    {
      "start": 213.2,
      "duration": 3.28,
      "text": "going on, what he thinks will happen,"
    },
    {
      "start": 214.959,
      "duration": 3.121,
      "text": "and what the implications for the Middle"
    },
    {
      "start": 216.48,
      "duration": 3.839,
      "text": "East will be, and whether he thinks"
    },
    {
      "start": 218.08,
      "duration": 3.84,
      "text": "President Trump should assist these"
    },
    {
      "start": 220.319,
      "duration": 3.601,
      "text": "protesters. So, this is a very"
    },
    {
      "start": 221.92,
      "duration": 3.039,
      "text": "interesting um story and segment. Stay"
    },
    {
      "start": 223.92,
      "duration": 2.879,
      "text": "with us for that."
    },
    {
      "start": 224.959,
      "duration": 3.681,
      "text": ">> I'm Steve Ducey. I'm Brian Kilme."
    },
    {
      "start": 226.799,
      "duration": 3.841,
      "text": ">> And I'm Anley Airhart. And click here to"
    },
    {
      "start": 228.64,
      "duration": 4.239,
      "text": "subscribe to the Fox News YouTube page"
    },
    {
      "start": 230.64,
      "duration": 5.8,
      "text": "to catch our hottest interviews and most"
    },
    {
      "start": 232.879,
      "duration": 3.561,
      "text": "compelling analysis."
    }
  ],
  "fullText": "Yeah. So, uh we are now learning that the death toll has risen to 203 in uh in Iran. And one of the most remarkable things about this is watching these images that are uh we're seeing out of Iran. Um the government of course has cut off the internet to the entire country. Uh they've even uh cut off landlines like old timey phone lines uh because they're trying to keep these images from getting out. uh they've been cutting electricity to cities and uh instepped Elon Musk with Starlink. The reason that we're seeing these images right now is because uh Starlink using satellites over Iran is able to and it's not a perfect system. It's not uh not everybody has the access that they that they want or that they need, but enough of these images and and video is getting out, which is the only reason we're seeing this. And one of the things I think is so interesting about this is that and and a real question is the the amount the number of uh outlets mainstream media outlets who are ignoring this story for some reason. For some reason they don't uh realize that this is the biggest story probably in the Middle East in uh in in nearly 50 years. >> Yeah. I mean, make no mistake, these images make a difference because public opinion uh globally makes a difference. I still remember um I don't know, it was four years ago when the Cubans had an uprising and it was quite significant. And what they wanted was video images to go out to the world, not just of the protests um but also of the repression um when the government finally got control and started to um arrest uh and and and and beat down many of the protesters and they were begging Joe Biden for the ability um you know to send some help for satellite so they could get those images out and Joe Biden said no. But then when the same things happened uh two years ago in Venezuela, Elon Musk, they didn't have to beg Joe Biden for anything. They were able to get it from Elon Musk just as the Iranians are doing. So Elon Musk, you know, just as he freed Twitter, um really playing a giant role in um in in in getting allowing people to to to speak freely and also for all of us to see what's going on. And you know to that point Rachel you got me thinking he's also like we saw President Trump saying we've got your back to Iran. Elon Musk is also standing with them. Just two days ago Elon Musk responded to Ayatollah Ket has been ratt saber rattling and saying we won't be defeated. And Musk tweeted a very famous Persian uh saying which is essentially say that the I told said we won't be defeated and he he tweeted out in Farsy he tweeted out that uh you know the the phrase that means wishful thinking or a vain fantasy that you won't be defeated and these protesters have been chanting that phrase in these protest last point it is so amazing because Lucas talked about pre979 Iran so many anyone under 40 years old is fighting for freedom that they have never in their life. >> That's such a great point. Well, you saw that uh that tweet out from Lindsey Graham. A lot of people get nervous when they see Lindsey Graham promoting something um some kind of military foreign action. Um but it's going to be interesting because we're going to have Patrick Bet David. He is a refugee from Iran. He's a very famous, as you guys know, podcaster um and businessman in America here. and we're going to have him come on to explain, you know, what's going on, what he thinks will happen, and what the implications for the Middle East will be, and whether he thinks President Trump should assist these protesters. So, this is a very interesting um story and segment. Stay with us for that. >> I'm Steve Ducey. I'm Brian Kilme. >> And I'm Anley Airhart. And click here to subscribe to the Fox News YouTube page to catch our hottest interviews and most compelling analysis.",
  "fetchedAt": "2026-01-18T18:33:37.526Z"
}