{
  "videoId": "PU8JhgLPxes",
  "language": "en",
  "source": "caption-extractor",
  "segments": [
    {
      "start": 0.24,
      "duration": 6.16,
      "text": "Hello world. Uh, my name is Jacob and"
    },
    {
      "start": 4.24,
      "duration": 5.92,
      "text": "I'm here to show you a little bit of"
    },
    {
      "start": 6.4,
      "duration": 5.84,
      "text": "updates on the Notebook LM MCP that I"
    },
    {
      "start": 10.16,
      "duration": 3.92,
      "text": "released last week before the end of the"
    },
    {
      "start": 12.24,
      "duration": 4.16,
      "text": "year. So, first of all, thank you for"
    },
    {
      "start": 14.08,
      "duration": 4.72,
      "text": "everyone on Reddit and YouTube and"
    },
    {
      "start": 16.4,
      "duration": 4.56,
      "text": "elsewhere. I posted this for the great"
    },
    {
      "start": 18.8,
      "duration": 4.719,
      "text": "feedback and and you know excitement"
    },
    {
      "start": 20.96,
      "duration": 5.68,
      "text": "around this. I really appreciate it and"
    },
    {
      "start": 23.519,
      "duration": 7.361,
      "text": "humbled. So one of the common questions"
    },
    {
      "start": 26.64,
      "duration": 6.48,
      "text": "were you know asking people were asking"
    },
    {
      "start": 30.88,
      "duration": 4.16,
      "text": "what exactly I I can do with this and"
    },
    {
      "start": 33.12,
      "duration": 4.88,
      "text": "and I think the reason stemmed from the"
    },
    {
      "start": 35.04,
      "duration": 5.519,
      "text": "issue that I showed cloud code which is"
    },
    {
      "start": 38,
      "duration": 6.239,
      "text": "a tool a CLI tool command line tool"
    },
    {
      "start": 40.559,
      "duration": 6.721,
      "text": "designed for developers and uh it's just"
    },
    {
      "start": 44.239,
      "duration": 5.681,
      "text": "overwhelming for users. So I tried I'm"
    },
    {
      "start": 47.28,
      "duration": 4.56,
      "text": "trying to show a little bit maybe a"
    },
    {
      "start": 49.92,
      "duration": 4.799,
      "text": "little bit more general approach to"
    },
    {
      "start": 51.84,
      "duration": 6.32,
      "text": "this. For example, I'm going to be using"
    },
    {
      "start": 54.719,
      "duration": 5.36,
      "text": "cloud desktop uh if you're even for"
    },
    {
      "start": 58.16,
      "duration": 3.919,
      "text": "free. So, I'm on the free plan. So,"
    },
    {
      "start": 60.079,
      "duration": 4.001,
      "text": "hopefully you will not run out in limits"
    },
    {
      "start": 62.079,
      "duration": 3.681,
      "text": "during this demo. But I want to show you"
    },
    {
      "start": 64.08,
      "duration": 4.8,
      "text": "how you can use this tool to manage your"
    },
    {
      "start": 65.76,
      "duration": 4.98,
      "text": "notebook lm from cloud desktop. And I"
    },
    {
      "start": 68.88,
      "duration": 4.08,
      "text": "will also I think you can do this also"
    },
    {
      "start": 70.74,
      "duration": 5.739,
      "text": "[clears throat] with perplexity uh for"
    },
    {
      "start": 72.96,
      "duration": 4.96,
      "text": "Mac the desktop app. So, I will record a"
    },
    {
      "start": 76.479,
      "duration": 4.64,
      "text": "different video to show the same"
    },
    {
      "start": 77.92,
      "duration": 6.96,
      "text": "process. So before we start kind of a"
    },
    {
      "start": 81.119,
      "duration": 6.161,
      "text": "couple of changes I made to this um page"
    },
    {
      "start": 84.88,
      "duration": 4.239,
      "text": "just a few minutes ago and what I've"
    },
    {
      "start": 87.28,
      "duration": 4.24,
      "text": "done first of all during the the new"
    },
    {
      "start": 89.119,
      "duration": 6.401,
      "text": "year I worked on simplifying this. So I"
    },
    {
      "start": 91.52,
      "duration": 6.16,
      "text": "published this tool on pypl"
    },
    {
      "start": 95.52,
      "duration": 4.88,
      "text": "which is a distribution mechanism for"
    },
    {
      "start": 97.68,
      "duration": 4.799,
      "text": "python packages which I can use for"
    },
    {
      "start": 100.4,
      "duration": 5.52,
      "text": "example uv command or install it with"
    },
    {
      "start": 102.479,
      "duration": 5.441,
      "text": "peep if you don't have uv or pex"
    },
    {
      "start": 105.92,
      "duration": 4,
      "text": "but if you prefer the old method of"
    },
    {
      "start": 107.92,
      "duration": 3.76,
      "text": "installing it by cloning this repo and"
    },
    {
      "start": 109.92,
      "duration": 4.64,
      "text": "installing it's still available but I"
    },
    {
      "start": 111.68,
      "duration": 5.68,
      "text": "think this is more convenient. So let me"
    },
    {
      "start": 114.56,
      "duration": 6.48,
      "text": "install it. I cleaned my computer uh"
    },
    {
      "start": 117.36,
      "duration": 6.88,
      "text": "from everything. So if I'll go to uh UV"
    },
    {
      "start": 121.04,
      "duration": 5.359,
      "text": "tool list,"
    },
    {
      "start": 124.24,
      "duration": 3.999,
      "text": "you'll see that I only have one MCP"
    },
    {
      "start": 126.399,
      "duration": 4.961,
      "text": "tool. This is not related. This is my"
    },
    {
      "start": 128.239,
      "duration": 5.281,
      "text": "readonly Google workspace uh which you"
    },
    {
      "start": 131.36,
      "duration": 4.08,
      "text": "can find on my GitHub if you want to try"
    },
    {
      "start": 133.52,
      "duration": 5.56,
      "text": "it out. It's read only by the way. So"
    },
    {
      "start": 135.44,
      "duration": 3.64,
      "text": "let's install it."
    },
    {
      "start": 139.52,
      "duration": 4,
      "text": "Done. Now let's authenticate. So if you"
    },
    {
      "start": 142,
      "duration": 3.76,
      "text": "remember from my previous video, the"
    },
    {
      "start": 143.52,
      "duration": 4.48,
      "text": "easiest way to authenticate is to let"
    },
    {
      "start": 145.76,
      "duration": 5.28,
      "text": "the tool do that for you."
    },
    {
      "start": 148,
      "duration": 6.239,
      "text": "Once I run it, it will launch the tool"
    },
    {
      "start": 151.04,
      "duration": 5.6,
      "text": "browser pardon me and the browser will"
    },
    {
      "start": 154.239,
      "duration": 4.801,
      "text": "go through the automation, you know, of"
    },
    {
      "start": 156.64,
      "duration": 4.239,
      "text": "going into notebook and we're going to"
    },
    {
      "start": 159.04,
      "duration": 7.76,
      "text": "extract the session cookies required for"
    },
    {
      "start": 160.879,
      "duration": 9.041,
      "text": "this MCP and that's it. I'm done. So,"
    },
    {
      "start": 166.8,
      "duration": 5.6,
      "text": "how do we add this to cloud code for"
    },
    {
      "start": 169.92,
      "duration": 5.36,
      "text": "example? So, the easiest way is to use"
    },
    {
      "start": 172.4,
      "duration": 4.72,
      "text": "this JSON file. And you can see it's"
    },
    {
      "start": 175.28,
      "duration": 4.48,
      "text": "going to ask you for for example on Mac"
    },
    {
      "start": 177.12,
      "duration": 4.24,
      "text": "what is your uh path. The easiest way to"
    },
    {
      "start": 179.76,
      "duration": 5.44,
      "text": "do that is just you know you can do the"
    },
    {
      "start": 181.36,
      "duration": 5.44,
      "text": "which command on on Mac and that will"
    },
    {
      "start": 185.2,
      "duration": 3.759,
      "text": "give me the path. So this is the path I"
    },
    {
      "start": 186.8,
      "duration": 4,
      "text": "need to use. I just need to replace that"
    },
    {
      "start": 188.959,
      "duration": 5.521,
      "text": "username I have there the placeholder"
    },
    {
      "start": 190.8,
      "duration": 5.12,
      "text": "with my local system username. So that's"
    },
    {
      "start": 194.48,
      "duration": 4.08,
      "text": "that. So I'm going to go back and I'm"
    },
    {
      "start": 195.92,
      "duration": 6.08,
      "text": "going to copy this and let me show you"
    },
    {
      "start": 198.56,
      "duration": 4.88,
      "text": "how to do this in cloud desktop. Um, you"
    },
    {
      "start": 202,
      "duration": 3.2,
      "text": "probably don't see it because I don't"
    },
    {
      "start": 203.44,
      "duration": 6,
      "text": "record this top section. So, my"
    },
    {
      "start": 205.2,
      "duration": 6.8,
      "text": "apologies. Uh, and click on settings"
    },
    {
      "start": 209.44,
      "duration": 4.24,
      "text": "and here you go into the developer. You"
    },
    {
      "start": 212,
      "duration": 4.799,
      "text": "see I have nothing to configured and"
    },
    {
      "start": 213.68,
      "duration": 5.199,
      "text": "I'll click edit. That will open uh a"
    },
    {
      "start": 216.799,
      "duration": 3.681,
      "text": "path to the file and I'm going to double"
    },
    {
      "start": 218.879,
      "duration": 4.321,
      "text": "click it. And depends on what you have"
    },
    {
      "start": 220.48,
      "duration": 6.64,
      "text": "configured on your system for JSON."
    },
    {
      "start": 223.2,
      "duration": 6.72,
      "text": "Example here I have virtual VS code uh"
    },
    {
      "start": 227.12,
      "duration": 5.839,
      "text": "linked to JSON files. I'll just going to"
    },
    {
      "start": 229.92,
      "duration": 8.64,
      "text": "paste this in and I'm just going to"
    },
    {
      "start": 232.959,
      "duration": 9.761,
      "text": "change this to my user which was JBD."
    },
    {
      "start": 238.56,
      "duration": 5.679,
      "text": "And that's technically it. So it's all"
    },
    {
      "start": 242.72,
      "duration": 4,
      "text": "configured and I hope I didn't make any"
    },
    {
      "start": 244.239,
      "duration": 5.441,
      "text": "mistake. I'm going to close this. I'm"
    },
    {
      "start": 246.72,
      "duration": 6.879,
      "text": "going to close cloud and let's open"
    },
    {
      "start": 249.68,
      "duration": 6.16,
      "text": "cloud again. Okay, no error. So I"
    },
    {
      "start": 253.599,
      "duration": 4.721,
      "text": "installed the MCP. I configured it. I"
    },
    {
      "start": 255.84,
      "duration": 5.76,
      "text": "already did the authentication. So now"
    },
    {
      "start": 258.32,
      "duration": 6.4,
      "text": "it's just a matter of asking Claude,"
    },
    {
      "start": 261.6,
      "duration": 6.24,
      "text": "hey Claude, how many notebook LM MCPS do"
    },
    {
      "start": 264.72,
      "duration": 5.84,
      "text": "I have?"
    },
    {
      "start": 267.84,
      "duration": 4.96,
      "text": "So now Claude should look into its"
    },
    {
      "start": 270.56,
      "duration": 3.76,
      "text": "system think what's the user is asking"
    },
    {
      "start": 272.8,
      "duration": 3.839,
      "text": "is there a tool that answer this and"
    },
    {
      "start": 274.32,
      "duration": 4.72,
      "text": "it's already yes there is a tool do you"
    },
    {
      "start": 276.639,
      "duration": 4.161,
      "text": "want me to list? So I'll say allow once"
    },
    {
      "start": 279.04,
      "duration": 5.599,
      "text": "or I can do you know feel free to do"
    },
    {
      "start": 280.8,
      "duration": 6.959,
      "text": "whatever you want and there we go. So,"
    },
    {
      "start": 284.639,
      "duration": 6.641,
      "text": "it's connected. It goes to my Notebook"
    },
    {
      "start": 287.759,
      "duration": 5.681,
      "text": "LM and the most recent one. Okay. So,"
    },
    {
      "start": 291.28,
      "duration": 5.44,
      "text": "let's see."
    },
    {
      "start": 293.44,
      "duration": 7.84,
      "text": "Can you add an infographic to JBD"
    },
    {
      "start": 296.72,
      "duration": 6.72,
      "text": "Notebook LM MCP doc notebook?"
    },
    {
      "start": 301.28,
      "duration": 3.919,
      "text": "And let's do that. And while it's doing"
    },
    {
      "start": 303.44,
      "duration": 5.599,
      "text": "it, let's see if it's probably going to"
    },
    {
      "start": 305.199,
      "duration": 7.56,
      "text": "ask me for the tool confirmation."
    },
    {
      "start": 309.039,
      "duration": 3.72,
      "text": "Uh, allowance."
    },
    {
      "start": 316.72,
      "duration": 3.28,
      "text": "Okay, so it started the process. So"
    },
    {
      "start": 318.4,
      "duration": 3.68,
      "text": "let's see what he did. So if I'll go"
    },
    {
      "start": 320,
      "duration": 3.919,
      "text": "back here and here's the notebook was"
    },
    {
      "start": 322.08,
      "duration": 4.16,
      "text": "referring to."
    },
    {
      "start": 323.919,
      "duration": 4.161,
      "text": "You can see I have the infographics. So"
    },
    {
      "start": 326.24,
      "duration": 3.28,
      "text": "every tool that I showed you in the"
    },
    {
      "start": 328.08,
      "duration": 3.6,
      "text": "previous video if you don't know what"
    },
    {
      "start": 329.52,
      "duration": 4.56,
      "text": "I'm talking about. Look back into my"
    },
    {
      "start": 331.68,
      "duration": 5.28,
      "text": "channel where I announced this um"
    },
    {
      "start": 334.08,
      "duration": 6,
      "text": "notebook LM MCP. So hopefully it gives"
    },
    {
      "start": 336.96,
      "duration": 5.6,
      "text": "you um insight and I will try maybe even"
    },
    {
      "start": 340.08,
      "duration": 5.28,
      "text": "today to release another video on how"
    },
    {
      "start": 342.56,
      "duration": 4.24,
      "text": "you can do this with uh perplexity which"
    },
    {
      "start": 345.36,
      "duration": 3.92,
      "text": "I think it's going to be very exciting"
    },
    {
      "start": 346.8,
      "duration": 5.839,
      "text": "because you can ask perplexity to do"
    },
    {
      "start": 349.28,
      "duration": 5.6,
      "text": "something like uh a deep research and"
    },
    {
      "start": 352.639,
      "duration": 4.721,
      "text": "then ask it to import that deep research"
    },
    {
      "start": 354.88,
      "duration": 5.039,
      "text": "as pasted text into this notebook. I'll"
    },
    {
      "start": 357.36,
      "duration": 4.88,
      "text": "I'll try to see if it works. So thank"
    },
    {
      "start": 359.919,
      "duration": 4.4,
      "text": "you very much for watching and looking"
    },
    {
      "start": 362.24,
      "duration": 4.72,
      "text": "forward to see you in my next video."
    },
    {
      "start": 364.319,
      "duration": 2.641,
      "text": "Cheers."
    }
  ],
  "fullText": "Hello world. Uh, my name is Jacob and I'm here to show you a little bit of updates on the Notebook LM MCP that I released last week before the end of the year. So, first of all, thank you for everyone on Reddit and YouTube and elsewhere. I posted this for the great feedback and and you know excitement around this. I really appreciate it and humbled. So one of the common questions were you know asking people were asking what exactly I I can do with this and and I think the reason stemmed from the issue that I showed cloud code which is a tool a CLI tool command line tool designed for developers and uh it's just overwhelming for users. So I tried I'm trying to show a little bit maybe a little bit more general approach to this. For example, I'm going to be using cloud desktop uh if you're even for free. So, I'm on the free plan. So, hopefully you will not run out in limits during this demo. But I want to show you how you can use this tool to manage your notebook lm from cloud desktop. And I will also I think you can do this also [clears throat] with perplexity uh for Mac the desktop app. So, I will record a different video to show the same process. So before we start kind of a couple of changes I made to this um page just a few minutes ago and what I've done first of all during the the new year I worked on simplifying this. So I published this tool on pypl which is a distribution mechanism for python packages which I can use for example uv command or install it with peep if you don't have uv or pex but if you prefer the old method of installing it by cloning this repo and installing it's still available but I think this is more convenient. So let me install it. I cleaned my computer uh from everything. So if I'll go to uh UV tool list, you'll see that I only have one MCP tool. This is not related. This is my readonly Google workspace uh which you can find on my GitHub if you want to try it out. It's read only by the way. So let's install it. Done. Now let's authenticate. So if you remember from my previous video, the easiest way to authenticate is to let the tool do that for you. Once I run it, it will launch the tool browser pardon me and the browser will go through the automation, you know, of going into notebook and we're going to extract the session cookies required for this MCP and that's it. I'm done. So, how do we add this to cloud code for example? So, the easiest way is to use this JSON file. And you can see it's going to ask you for for example on Mac what is your uh path. The easiest way to do that is just you know you can do the which command on on Mac and that will give me the path. So this is the path I need to use. I just need to replace that username I have there the placeholder with my local system username. So that's that. So I'm going to go back and I'm going to copy this and let me show you how to do this in cloud desktop. Um, you probably don't see it because I don't record this top section. So, my apologies. Uh, and click on settings and here you go into the developer. You see I have nothing to configured and I'll click edit. That will open uh a path to the file and I'm going to double click it. And depends on what you have configured on your system for JSON. Example here I have virtual VS code uh linked to JSON files. I'll just going to paste this in and I'm just going to change this to my user which was JBD. And that's technically it. So it's all configured and I hope I didn't make any mistake. I'm going to close this. I'm going to close cloud and let's open cloud again. Okay, no error. So I installed the MCP. I configured it. I already did the authentication. So now it's just a matter of asking Claude, hey Claude, how many notebook LM MCPS do I have? So now Claude should look into its system think what's the user is asking is there a tool that answer this and it's already yes there is a tool do you want me to list? So I'll say allow once or I can do you know feel free to do whatever you want and there we go. So, it's connected. It goes to my Notebook LM and the most recent one. Okay. So, let's see. Can you add an infographic to JBD Notebook LM MCP doc notebook? And let's do that. And while it's doing it, let's see if it's probably going to ask me for the tool confirmation. Uh, allowance. Okay, so it started the process. So let's see what he did. So if I'll go back here and here's the notebook was referring to. You can see I have the infographics. So every tool that I showed you in the previous video if you don't know what I'm talking about. Look back into my channel where I announced this um notebook LM MCP. So hopefully it gives you um insight and I will try maybe even today to release another video on how you can do this with uh perplexity which I think it's going to be very exciting because you can ask perplexity to do something like uh a deep research and then ask it to import that deep research as pasted text into this notebook. I'll I'll try to see if it works. So thank you very much for watching and looking forward to see you in my next video. Cheers.",
  "fetchedAt": "2026-01-18T18:32:46.652Z"
}